In [1]:
import pandas as pd

In [4]:
ratings = [4,5,4,5,3,4,5]
s = pd.Series(ratings,index=['A','B','C','D','E','F','G'])

In [5]:
s

A    4
B    5
C    4
D    5
E    3
F    4
G    5
dtype: int64

In [6]:
s[0]

4

In [7]:
s[0:3]

A    4
B    5
C    4
dtype: int64

In [8]:
names = ["Rohit","Dhawan","Virat","Dhoni","Rahane","Yuvraj","Jadhav","Jadeja","Bhuvi","Bumrah"]
scores = [56,30,120,55,26,58,96,4,7,0]
s_rate = [90.8,98.2,150.7,120.5,78.6,88.9,110.3,80.6,87.9,100.2]

data = {
    "names" : names,
    "scores" : scores,
    "s_rate" : s_rate
}

In [13]:
s = pd.Series(data['scores'],data['names'])

In [14]:
s

Rohit      56
Dhawan     30
Virat     120
Dhoni      55
Rahane     26
Yuvraj     58
Jadhav     96
Jadeja      4
Bhuvi       7
Bumrah      0
dtype: int64

In [15]:
df = pd.DataFrame(data)

In [16]:
df

    names  scores  s_rate
0   Rohit      56    90.8
1  Dhawan      30    98.2
2   Virat     120   150.7
3   Dhoni      55   120.5
4  Rahane      26    78.6
5  Yuvraj      58    88.9
6  Jadhav      96   110.3
7  Jadeja       4    80.6
8   Bhuvi       7    87.9
9  Bumrah       0   100.2

In [22]:
df[df['scores'] > 50]

    names  scores  s_rate
0   Rohit      56    90.8
2   Virat     120   150.7
3   Dhoni      55   120.5
5  Yuvraj      58    88.9
6  Jadhav      96   110.3

In [23]:
# head will return first 5 observations
df.head()

    names  scores  s_rate
0   Rohit      56    90.8
1  Dhawan      30    98.2
2   Virat     120   150.7
3   Dhoni      55   120.5
4  Rahane      26    78.6

In [24]:
# tail will return last 5 observations
df.tail()

    names  scores  s_rate
5  Yuvraj      58    88.9
6  Jadhav      96   110.3
7  Jadeja       4    80.6
8   Bhuvi       7    87.9
9  Bumrah       0   100.2

In [25]:
df.iloc[0]

names     Rohit
scores       56
s_rate     90.8
Name: 0, dtype: object

In [27]:
df.shape

(10, 3)

In [30]:
df.loc[0:2,['names']]

    names
0   Rohit
1  Dhawan
2   Virat

In [32]:
df.iloc[0:2,[0]]

    names
0   Rohit
1  Dhawan

In [33]:
df.describe()

           scores      s_rate
count   10.000000   10.000000
mean    45.200000  100.670000
std     39.932721   21.817936
min      0.000000   78.600000
25%     11.750000   88.150000
50%     42.500000   94.500000
75%     57.500000  107.775000
max    120.000000  150.700000